garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC12F1612.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T2CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0xxxxxxx" edc:name="T2CON" edc:nzwidth="8" edc:por="0xxxxxxx" edc:_modsrc="DOS-02458_tmr_mid2_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x1C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OUTPS" edc:desc="" edc:mask="0xf" edc:name="OUTPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CKPS" edc:desc="" edc:mask="0x7" edc:name="CKPS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2OUTPS" edc:desc="" edc:mask="0xf" edc:name="T2OUTPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="T2CKPS" edc:desc="" edc:mask="0x7" edc:name="T2CKPS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="T2ON" edc:desc="" edc:mask="0x1" edc:name="T2ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2OUTPS0" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS1" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS2" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS3" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKPS0" edc:desc="" edc:mask="0x1" edc:name="T2CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKPS1" edc:desc="" edc:mask="0x1" edc:name="T2CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKPS2" edc:desc="" edc:mask="0x1" edc:name="T2CKPS2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OUTPS0" edc:desc="" edc:mask="0x1" edc:name="OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS1" edc:desc="" edc:mask="0x1" edc:name="OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS2" edc:desc="" edc:mask="0x1" edc:name="OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS3" edc:desc="" edc:mask="0x1" edc:name="OUTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS0" edc:desc="" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS1" edc:desc="" edc:mask="0x1" edc:name="CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS2" edc:desc="" edc:mask="0x1" edc:name="CKPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR2ON" edc:desc="" edc:mask="0x1" edc:name="TMR2ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-nnnn" edc:cname="T2HLT" edc:desc="" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00x-0000" edc:name="T2HLT" edc:nzwidth="8" edc:por="00x-0000" edc:_modsrc="DOS-02458_tmr_mid2_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x1D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0xf" edc:name="MODE" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CKSYNC" edc:desc="" edc:mask="0x1" edc:name="CKSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPOL" edc:desc="" edc:mask="0x1" edc:name="CKPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSYNC" edc:desc="" edc:mask="0x1" edc:name="PSYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2MODE" edc:desc="" edc:mask="0xf" edc:name="T2MODE" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T2CKSYNC" edc:desc="" edc:mask="0x1" edc:name="T2CKSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKPOL" edc:desc="" edc:mask="0x1" edc:name="T2CKPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2PSYNC" edc:desc="" edc:mask="0x1" edc:name="T2PSYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T2MODE0" edc:desc="" edc:mask="0x1" edc:name="T2MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2MODE1" edc:desc="" edc:mask="0x1" edc:name="T2MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2MODE2" edc:desc="" edc:mask="0x1" edc:name="T2MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2MODE3" edc:desc="" edc:mask="0x1" edc:name="T2MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="T2CLKCON" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="T2CLKCON" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02458_tmr_mid2_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x1E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T2CS" edc:desc="" edc:mask="0x7" edc:name="T2CS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T2CS0" edc:desc="" edc:mask="0x1" edc:name="T2CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CS1" edc:desc="" edc:mask="0x1" edc:name="T2CS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CS2" edc:desc="" edc:mask="0x1" edc:name="T2CS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="T2RST" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="T2RST" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02458_tmr_mid2_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x1F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSEL" edc:desc="" edc:mask="0xf" edc:name="RSEL" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RSEL0" edc:desc="" edc:mask="0x1" edc:name="RSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSEL1" edc:desc="" edc:mask="0x1" edc:name="RSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSEL2" edc:desc="" edc:mask="0x1" edc:name="RSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSEL3" edc:desc="" edc:mask="0x1" edc:name="RSEL3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2RSEL" edc:desc="" edc:mask="0xf" edc:name="T2RSEL" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T2RSEL0" edc:desc="" edc:mask="0x1" edc:name="T2RSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL1" edc:desc="" edc:mask="0x1" edc:name="T2RSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL2" edc:desc="" edc:mask="0x1" edc:name="T2RSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL3" edc:desc="" edc:mask="0x1" edc:name="T2RSEL3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="1" edc:beginaddr="0x80" edc:endaddr="0xA0" edc:regionid="sfr1">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x80"/>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="TRISA" edc:desc="PORTA Data Direction Control Register" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--11u111" edc:name="TRISA" edc:nzwidth="0x8" edc:por="--11x111" edc:_addr="0x8C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISA0" edc:desc="" edc:mask="0x1" edc:name="TRISA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA1" edc:desc="" edc:mask="0x1" edc:name="TRISA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA2" edc:desc="" edc:mask="0x1" edc:name="TRISA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA3" edc:mask="0x1" edc:name="TRISA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA4" edc:desc="" edc:mask="0x1" edc:name="TRISA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA5" edc:desc="" edc:mask="0x1" edc:name="TRISA5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x8D"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x8E"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x8F"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x90"/>
        <edc:SFRDef edc:access="nn---nnn" edc:cname="PIE1" edc:desc="Peripheral Interrupt Enable Register 1" edc:impl="0xc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---000" edc:name="PIE1" edc:nzwidth="0x8" edc:por="00---000" edc:_addr="0x91">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1IE" edc:desc="TMR1 Overflow Interrupt Enable bit" edc:mask="0x1" edc:name="TMR1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR2IE" edc:desc="TMR2 to PR2 Match Interrupt Enable bit" edc:mask="0x1" edc:name="TMR2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IE" edc:desc="" edc:mask="0x1" edc:name="CCP1IE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADIE" edc:desc="A/D Converter Interrupt Enable bit" edc:mask="0x1" edc:name="ADIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1GIE" edc:desc="Timer1 Gate Interrupt Enable bit" edc:mask="0x1" edc:name="TMR1GIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
