garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC12F1612.PIC
        <edc:SFRDef edc:access="nnnnnnnr" edc:cname="CRCCON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCCON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02421_math_progcrc_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x79A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PLEN" edc:desc="" edc:mask="0xf" edc:name="PLEN" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DLEN" edc:desc="" edc:mask="0xf" edc:name="DLEN" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PLEN0" edc:desc="" edc:mask="0x1" edc:name="PLEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLEN1" edc:desc="" edc:mask="0x1" edc:name="PLEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLEN2" edc:desc="" edc:mask="0x1" edc:name="PLEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLEN3" edc:desc="" edc:mask="0x1" edc:name="PLEN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLEN0" edc:desc="" edc:mask="0x1" edc:name="DLEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLEN1" edc:desc="" edc:mask="0x1" edc:name="DLEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLEN2" edc:desc="" edc:mask="0x1" edc:name="DLEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLEN3" edc:desc="" edc:mask="0x1" edc:name="DLEN3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CRCPLEN" edc:desc="" edc:mask="0xf" edc:name="CRCPLEN" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CRCDLEN" edc:desc="" edc:mask="0xf" edc:name="CRCDLEN" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CRCPLEN0" edc:desc="" edc:mask="0x1" edc:name="CRCPLEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCPLEN1" edc:desc="" edc:mask="0x1" edc:name="CRCPLEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCPLEN2" edc:desc="" edc:mask="0x1" edc:name="CRCPLEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCPLEN3" edc:desc="" edc:mask="0x1" edc:name="CRCPLEN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCDLEN0" edc:desc="" edc:mask="0x1" edc:name="CRCDLEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCDLEN1" edc:desc="" edc:mask="0x1" edc:name="CRCDLEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCDLEN2" edc:desc="" edc:mask="0x1" edc:name="CRCDLEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCDLEN3" edc:desc="" edc:mask="0x1" edc:name="CRCDLEN3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="5" edc:_addr="0x79B"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="16" edc:beginaddr="0x800" edc:endaddr="0x820" edc:regionid="sfr16">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x800"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="17" edc:beginaddr="0x880" edc:endaddr="0x8a0" edc:regionid="sfr17">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x880"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="18" edc:beginaddr="0x900" edc:endaddr="0x920" edc:regionid="sfr18">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x900"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="19" edc:beginaddr="0x980" edc:endaddr="0x9a0" edc:regionid="sfr19">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x980"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="20" edc:beginaddr="0xa00" edc:endaddr="0xa20" edc:regionid="sfr20">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xA00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="21" edc:beginaddr="0xa80" edc:endaddr="0xaa0" edc:regionid="sfr21">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xA80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="22" edc:beginaddr="0xb00" edc:endaddr="0xb20" edc:regionid="sfr22">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xB00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="23" edc:beginaddr="0xb80" edc:endaddr="0xba0" edc:regionid="sfr23">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xB80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="24" edc:beginaddr="0xc00" edc:endaddr="0xc20" edc:regionid="sfr24">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xC00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="25" edc:beginaddr="0xc80" edc:endaddr="0xca0" edc:regionid="sfr25">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xC80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="26" edc:beginaddr="0xd00" edc:endaddr="0xd20" edc:regionid="sfr26">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xD00"/>
        <edc:AdjustPoint edc:offset="5" edc:_addr="0xD0C"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="27" edc:beginaddr="0xd80" edc:endaddr="0xdb0" edc:regionid="sfr27">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xD80"/>
        <edc:JoinedSFRDef edc:cname="SMT1TMR" edc:desc="" edc:name="SMT1TMR" edc:nzwidth="0x18" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD8C">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SMT1TMRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SMT1TMRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD8C">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1TMR" edc:desc="" edc:mask="0xff" edc:name="SMT1TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1TMR0" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR1" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR2" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR3" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR4" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR5" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR6" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR7" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SMT1TMRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SMT1TMRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD8D">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1TMR" edc:desc="" edc:mask="0xff" edc:name="SMT1TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1TMR8" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR9" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR10" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR11" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR12" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR13" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR14" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR15" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SMT1TMRU" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SMT1TMRU" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD8E">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1TMR" edc:desc="" edc:mask="0xff" edc:name="SMT1TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1TMR16" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR17" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR18" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR19" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR20" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR21" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR22" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR23" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR23" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="SMT1CPR" edc:desc="" edc:name="SMT1CPR" edc:nzwidth="0x18" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD8F">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT1CPRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT1CPRL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD8F">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1CPR" edc:desc="" edc:mask="0xff" edc:name="SMT1CPR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1CPR0" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR1" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR2" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR3" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR4" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR5" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR6" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR7" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT1CPRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT1CPRH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD90">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1CPR" edc:desc="" edc:mask="0xff" edc:name="SMT1CPR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1CPR8" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR9" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR10" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR11" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR12" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR13" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR14" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR15" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT1CPRU" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT1CPRU" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD91">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1CPR" edc:desc="" edc:mask="0xff" edc:name="SMT1CPR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SMT1CPR16" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR17" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR18" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR19" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR20" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR21" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR22" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR23" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR23" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="SMT1CPW" edc:desc="" edc:name="SMT1CPW" edc:nzwidth="0x18" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD92">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT1CPWL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT1CPWL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD92">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1CPW" edc:desc="" edc:mask="0xff" edc:name="SMT1CPW" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1CPW0" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW1" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW2" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW3" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW4" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW5" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW6" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW7" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT1CPWH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT1CPWH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD93">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1CPW" edc:desc="" edc:mask="0xff" edc:name="SMT1CPW" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1CPW8" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW9" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW10" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW11" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW12" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW13" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW14" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW15" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT1CPWU" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT1CPWU" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD94">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1CPW" edc:desc="" edc:mask="0xff" edc:name="SMT1CPW" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1CPW16" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW17" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW18" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW19" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW20" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW21" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW22" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW23" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW23" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="SMT1PR" edc:desc="" edc:name="SMT1PR" edc:nzwidth="0x18" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD95">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SMT1PRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SMT1PRL" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD95">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1PR" edc:desc="" edc:mask="0xff" edc:name="SMT1PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1PR0" edc:desc="" edc:mask="0x1" edc:name="SMT1PR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR1" edc:desc="" edc:mask="0x1" edc:name="SMT1PR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR2" edc:desc="" edc:mask="0x1" edc:name="SMT1PR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR3" edc:desc="" edc:mask="0x1" edc:name="SMT1PR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR4" edc:desc="" edc:mask="0x1" edc:name="SMT1PR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR5" edc:desc="" edc:mask="0x1" edc:name="SMT1PR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR6" edc:desc="" edc:mask="0x1" edc:name="SMT1PR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR7" edc:desc="" edc:mask="0x1" edc:name="SMT1PR7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
